# ResList_SetSel

## Description
Set the selected item in the resource popup. The 'uniqueID' is a string identifier uniquely identifying this control.

```pascal
PROCEDURE ResList_SetSel(
				uniqueID : STRING;
				itemName : STRING);
```

```python
def vs.ResList_SetSel(uniqueID, itemName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|uniqueID|STRING|   |
|itemName|STRING|   |

## Version
Availability: from Vectorworks 2017

## Category
* Document List Handling